artillery/load-test-1.yml
config:
  target: 'http://pet-supplies-shop-ALB-803410956.ap-southeast-2.elb.amazonaws.com'
  phases:
    - duration: 120
      arrivalRate: 50
      name: Sustained 50 VU/s
  http:
    timeout: 10
  ensure:
    p99: 2000
    maxErrorRate: 1

scenarios:
  - name: Health check
    flow:
      - get:
          url: /api/health