artillery/load-test-2.yml
config:
  # Replace REPLACE_WITH_ALB_DNS with the actual ALB DNS name after Task 6
  target: 'http://REPLACE_WITH_ALB_DNS'
  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 200
      name: Ramp 1 to 200 VU/s
  http:
    timeout: 10

scenarios:
  - name: Health check
    flow:
      - get:
          url: /api/health
  - name: Products
    flow:
      - get:
          url: /api/products