artillery/load-test-2.yml
config:
  target: 'http://pet-supplies-shop-ALB-803410956.ap-southeast-2.elb.amazonaws.com'
  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 200
      name: Ramp 1 to 200 VU/s
  http:
    timeout: 10
  ensure:
    p99: 2000
    maxErrorRate: 1

scenarios:
  - name: Health check
    flow:
      - get:
          url: /api/health